[
    {
        "source": "Kalshi",
        "market_id": "AAPLCEOCHANGE-24",
        "status": "Active",
        "headline": "Tim Cook leaves Apple in 2024? Before Dec 31, 2024",
        "description": "If Tim Cook is no longer CEO of Apple by Dec 31, 2024, then the market resolves to Yes.",
        "end_date": "2025-01-01T04:59:00Z",
        "yes_ask": 0.05,
        "no_ask": 0.97,
        "liquidity": 804698
    },
    {
        "source": "Polymarket",
        "market_id": "0x65e179d9edb415923e4ed78f2a9d6a60b7b10a4afd2f84270284c4d5a5c90cd4",
        "status": "Active",
        "headline": "Will Duke beat UNC?",
        "description": "In the upcoming NCAA Football game, scheduled for September 28, 2024, at 4:00 PM ET:\n\nIf the Duke Blue Devils win, the market will resolve to “Duke\".\n\nIf the North Carolina Tar Heels win, the market will resolve to “UNC\".\n\nIf the game is not completed by October 5, 2024 (11:59 PM ET) or it ends in a tie, the market will resolve 50-50.\n\nThe primary resolution source for this market will be official information from the NCAA, however, a consensus of credible reporting will also be used.",
        "end_date": "2024-09-28T12:00:00Z",
        "yes_ask": null,
        "no_ask": null,
        "liquidity": 8366.771
    },
    {
        "source": "Polymarket",
        "market_id": "0x1f5f0d3a3662423d9f24d46b001f1de4e4dcd4f3c0e200d45c1c23e87b503c29",
        "status": "Active",
        "headline": "Democrat other than Biden wins the Election?",
        "description": "This market will resolve to \"Yes\" if any Democratic candidate other than Joe Biden wins the 2024 US Presidential Election. Otherwise, this market will resolve to \"No.\"\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race for the same candidate by the inauguration date (January 20, 2025) this market will resolve based on who is inaugurated.\n\n",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.505,
        "no_ask": 0.495,
        "liquidity": 66264.9914
    },
    {
        "source": "Polymarket",
        "market_id": "0x69d49cd801c35981676c8c991407623a7add2a0c1a007f28cdccfdf5e74da19a",
        "status": "Active",
        "headline": "Martin Shkreli jail in 2024?",
        "description": "This market will resolve to \"Yes\" if Martin Shkreli serves any time in a federal, state, or local U.S. jail or prison between June 17 and December 31, 2024, by 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nThe primary resolution source for this market will be official information from the U.S. Government, however a consensus of credible reporting may also be used.\n",
        "end_date": "2024-12-31T12:00:00Z",
        "yes_ask": 0.045,
        "no_ask": 0.955,
        "liquidity": 7071.7891
    },
    {
        "source": "Polymarket",
        "market_id": "0x72f9ef10ec8ff6d30c3a88ec12049f1a06cbddf04428a5b8af906e85550cb5c6",
        "status": "Active",
        "headline": "Will UCF and Colorado combine for 64 or more points?",
        "description": "This market refers to the NCAAF matchup between the UCF Knights and the Colorado Buffaloes scheduled for September 28, 2024, at 3:30 PM ET.\n\nIf the combined total points scored by the UCF Knights and the Colorado Buffaloes in their game on September 28, 2024, is 64 or more, this market will resolve to “Over\". If it is less than 64, this market will resolve to “Under\".\n\nIf this game is postponed after October 5, 2024 (11:59 PM ET), or cancelled, this market will resolve 50-50.\n\nThe primary resolution source for this market will be official information from the NCAA, however, a consensus of credible reporting will also be used.",
        "end_date": "2024-09-28T12:00:00Z",
        "yes_ask": null,
        "no_ask": null,
        "liquidity": 1203.99
    },
    {
        "source": "Polymarket",
        "market_id": "0x4f03c2d42286d0fcd70757667e7bf2acbcc964dd911fc6c841453c586c225ee1",
        "status": "Active",
        "headline": "Will Max Homa score the most points at the Presidents Cup?",
        "description": "This market will resolve to “Yes” if Max Homa scores more points than any other golfer at the 2024 Presidents Cup. Otherwise, this market will resolve to “No”.\n\nThe primary resolution sources will be official information from the Presidents Cup (presidentscup.com), however a consensus of credible reporting may also be used.",
        "end_date": "2024-09-29T12:00:00Z",
        "yes_ask": 0.2505,
        "no_ask": 0.7495,
        "liquidity": 109.311
    },
    {
        "source": "Polymarket",
        "market_id": "0x5f0de9f7ef85003356acb6117d235a4fa45ed5718d2a467ea7015cc92ae68713",
        "status": "Active",
        "headline": "Will the Seattle Seahawks win the NFC West",
        "description": "This market will resolve to “Yes” if the Seattle Seahawks win the NFC West in the 2024-2025 NFL Season. Otherwise, this market will resolve to “No”.\n\nIf at any point it becomes impossible for the Seattle Seahawks team to win the NFC West based on the rules of the NFL (e.g., they are mathematically eliminated from finishing first in the division), this market will resolve immediately to “No”.",
        "end_date": "2025-01-06T12:00:00Z",
        "yes_ask": 0.345,
        "no_ask": 0.655,
        "liquidity": 15917.7306
    },
    {
        "source": "Polymarket",
        "market_id": "0xbe3afc95f538c106696a2b76a1eb6e2191b622b224ae9d888343ade752c634f1",
        "status": "Active",
        "headline": "2024 presidential election: Democrats win by 15-34",
        "description": "This market will resolve to \"Yes\" if the democrat-nominated candidate for the 2024 US presidential election wins by between 15 and 34 electoral college votes (inclusive) compared with the second place party. Otherwise, this market will resolve to \"No\".\n\nThe resolution source will be an overwhelming consensus of credible reporting on the final electoral college tally based on which territories each candidate wins.\n",
        "end_date": "2024-11-04T12:00:00Z",
        "yes_ask": 0.049,
        "no_ask": 0.951,
        "liquidity": 162275.38436
    },
    {
        "source": "Polymarket",
        "market_id": "0xde95fcbba4526edc5b109bf2969967dc80a3706d447f2c1088787962ff75422a",
        "status": "Active",
        "headline": "Puffer airdrop by September 30?",
        "description": "This market will resolve to \"Yes\" if Puffer launches a token and announces they have performed an airdrop between June 25 and September 30, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nFor the purposes of this market \"locked\" tokens or non-swappable tokens will not suffice to resolve this market to \"Yes\".\n\nThe primary resolution source for this market is on-chain information and official information from the Puffer team, however a consensus of credible reporting will also be used.",
        "end_date": "2024-09-30T12:00:00Z",
        "yes_ask": 0.003,
        "no_ask": 0.997,
        "liquidity": 31646.23477
    },
    {
        "source": "Polymarket",
        "market_id": "0x3cb37211fb24794f0e7425561c22b94f02791a42725e86230b13b2eec4839664",
        "status": "Active",
        "headline": "Berachain airdrop by September 30?",
        "description": "This market will resolve to \"Yes\" if Berachain launches a token and announces they have performed an airdrop between September 8 and September 30, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nFor the purposes of this market \"locked\" tokens or non-swappable tokens will not suffice to resolve this market to \"Yes\".\n\nThe primary resolution source for this market is on-chain information and official information from the Berachain team, however a consensus of credible reporting will also be used.",
        "end_date": "2024-09-30T12:00:00Z",
        "yes_ask": 0.005,
        "no_ask": 0.995,
        "liquidity": 8827.09501
    },
    {
        "source": "Polymarket",
        "market_id": "0x0c4c0dacce64630677da458d290cec514d628c3d6f2a82873ef14a73f4ac880e",
        "status": "Active",
        "headline": "Will JD Vance say \"rig\" or \"rigged\" during the debate?",
        "description": "Tim Walz and J.D. Vance are currently scheduled to debate on October 1, in an event hosted by CBS.\n\nThis market will resolve to \"Yes\" if Vance says \"rig\" or \"rigged\" any point during the first vice presidential debate between Tim Walz and J.D. Vance in the 2024 election cycle. Otherwise, this market will resolve to \"No\".\n\nAny usage of the word regardless of context will count toward the resolution of this market.\n\nPluralization/possessive of the word will count toward the resolution of this market, however other forms will NOT count.\n\nCompound words will count as long as \"rig\" or \"rigged\" is part of the compound word and references the meaning which refers to managing or conducting (something) fraudulently so as to produce a result or situation that is advantageous to a particular person.\n\nIf no such debate in the 2024 election cycle happens by November 4, 2024, 11:59 PM ET, or if either candidate drops out of the race, this market will resolve to \"No\".\n\nThe resolution source will be the video of the debate.",
        "end_date": "2024-10-01T12:00:00Z",
        "yes_ask": 0.11,
        "no_ask": 0.89,
        "liquidity": 5596.4378
    },
    {
        "source": "Polymarket",
        "market_id": "0xa11a9c66032cbe8c607bf1b21591f65dfee9d5eb65d73cc8ad5009c1f9826fa3",
        "status": "Active",
        "headline": "Fed decreases interest rates by 25 bps after December 2024 meeting?",
        "description": "The FED interest rates are defined in this market by the upper bound of the target federal funds range. The decisions on the target federal fund range are made by the Federal Open Market Committee (FOMC) meetings.\n\nThis market will resolve to “Yes” if following the Federal Reserve's December 2024 meeting the upper bound of the target federal funds rate is decreased by exactly 25 basis points below the level it was prior to the meeting. Otherwise, it will resolve to “No”.\n\nThe resolution source for this market is the FOMC’s statement after its meeting scheduled for December 17 - 18, 2024 according to the official calendar: https://www.federalreserve.gov/monetarypolicy/fomccalendars.htm.\n\nThe level and change of the target federal funds rate is also published at the official website of the Federal Reserve at https://www.federalreserve.gov/monetarypolicy/openmarket.htm.\n\nThis market may resolve as soon as the FOMC’s statement for their December meeting with relevant data is issued. If no statement is released by the end date of the next scheduled meeting, this market will resolve to the \"No change\" bracket.",
        "end_date": "2024-12-18T12:00:00Z",
        "yes_ask": 0.465,
        "no_ask": 0.535,
        "liquidity": 39205.7315
    },
    {
        "source": "Polymarket",
        "market_id": "0x82383a251c5f9fd079dbad01fbed20e6a1e9c59fa90c0336144174aa49350abc",
        "status": "Active",
        "headline": "Will Christian McCaffrey play Week 6?",
        "description": "This market will resolve to \"Yes\" if Christian McCaffrey plays in the San Francisco 49ers' Week 6 game against the Seattle Seahawks scheduled for October 10, 2024. Otherwise, this market will resolve to \"No\".\n\nIf the game is canceled or postponed beyond October 13, 2024, this market will resolve to \"No\".\n\nIf McCaffrey is cut, traded, retires, or is otherwise officially ruled out for the game, this market will resolve to \"No\".\n\n\"Playing\" is defined as Christian McCaffrey participating in at least one snap (including kickoffs) during the game. Merely being on the game-day roster will not qualify for a \"Yes\" resolution.",
        "end_date": "2024-10-10T12:00:00Z",
        "yes_ask": 0.037,
        "no_ask": 0.963,
        "liquidity": 13678.5335
    },
    {
        "source": "Polymarket",
        "market_id": "0xa88a783b0926a90c5e0a3e6543293570c16f620392f12bfc08dd194c614e7e00",
        "status": "Active",
        "headline": "Trump sentenced to between 12 and 23 months prison time?",
        "description": "This market will resolve to \"Yes\" if Donald Trump is sentenced to spend between 12 (inclusive) months and 23 months (inclusive) in the custody of a jail or prison, as part of \"The State of New York vs. Donald Trump\". Otherwise, this market will resolve to \"No\".\n\nThis market will resolve immediately based on the first sentence passed in this case, regardless of appeals. If the first sentencing in this case does not include jail or prison time, this market will resolve to \"No\".\n\nIf no sentence is rendered in this case by November 4, 2024, 11:59 PM ET, this market will resolve to \"No\".\n\nThe primary resolution source for this market will be official information from involved government(s), however a consensus of credible reporting may also be used.",
        "end_date": "2024-07-11T12:00:00Z",
        "yes_ask": 0.0025,
        "no_ask": 0.9975,
        "liquidity": 224846.54459
    }
]