[
    {
        "source": "Polymarket",
        "market_id": "0xfca3e637b1b126a59dd2aac2ca89d501f30c0aacb5dbf9b7b5f1d2c18ca00a55",
        "status": "Active",
        "headline": "Will Dynamo Kyiv win the UEFA Europa League?",
        "description": "This market will resolve to “Yes” if Dynamo Kyiv wins the 2024-25 UEFA Europa League. Otherwise, this market will resolve to “No”.\n\nIf at any point it becomes impossible for this team to win the 2024-2025 UEFA Europa League based on the rules of the tournament (e.g. they are eliminated), this market will resolve immediately to “No”.",
        "end_date": "2025-05-21T12:00:00Z",
        "yes_ask": 0.008,
        "no_ask": 0.992,
        "liquidity": 37630.94188
    },
    {
        "source": "Polymarket",
        "market_id": "0xde95fcbba4526edc5b109bf2969967dc80a3706d447f2c1088787962ff75422a",
        "status": "Active",
        "headline": "Puffer airdrop by September 30?",
        "description": "This market will resolve to \"Yes\" if Puffer launches a token and announces they have performed an airdrop between June 25 and September 30, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nFor the purposes of this market \"locked\" tokens or non-swappable tokens will not suffice to resolve this market to \"Yes\".\n\nThe primary resolution source for this market is on-chain information and official information from the Puffer team, however a consensus of credible reporting will also be used.",
        "end_date": "2024-09-30T12:00:00Z",
        "yes_ask": 0.003,
        "no_ask": 0.997,
        "liquidity": 31202.61315
    },
    {
        "source": "Polymarket",
        "market_id": "0x13137815713e2549030a2cd576f14c4e0442a7794782bc0ecd392b2090edfc1c",
        "status": "Active",
        "headline": "Will the Democratic candidate win Pennsylvania by 0.5%-1%?",
        "description": "This market will resolve to \"Yes” if the Democratic Party candidate wins the popular vote in Pennsylvania in the 2024 U.S. Presidential Election by between 0.5% (inclusive) and 1% (exclusive) or more when compared with the second place candidate. Otherwise, this market will resolve to \"No\".\n\nFor the purpose of resolving this market, the 'margin of victory' is defined as the absolute difference between the percentages of votes received by the Democratic Party candidate and the second-place candidate. Percentages of the votes received by each party will be determined by dividing the total number of votes each of the top two candidates receives by the sum of all votes cast in Pennsylvania for the 2024 U.S. Presidential Election.\n\nThis market will resolve based off the official vote count once Pennsylvania has certified the vote. \n\nIf a recount is initiated before certification, the market will remain open until the recount is completed and the vote is certified. If a recount occurs after certification, the recount will not be considered.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.065,
        "no_ask": 0.935,
        "liquidity": 35388.2459
    },
    {
        "source": "Polymarket",
        "market_id": "0x1971083d1c2825b6020d07d51c13ddba71ae55b6e90446154910986e20a61962",
        "status": "Active",
        "headline": "Will JD Vance say \"Usha\" during the debate?",
        "description": "Tim Walz and J.D. Vance are currently scheduled to debate on October 1, in an event hosted by CBS.\n\nThis market will resolve to \"Yes\" if Vance says \"Usha\" any point during the first vice presidential debate between Tim Walz and J.D. Vance in the 2024 election cycle. Otherwise, this market will resolve to \"No\".\n\nAny usage of the word regardless of context will count toward the resolution of this market.\n\nPluralization/possessive of the word will count toward the resolution of this market, however other forms will NOT count.\n\nCompound words will count as long as \"Usha\" is part of the compound word and references the person Usha Vance.\n\nIf no such debate in the 2024 election cycle happens by November 4, 2024, 11:59 PM ET, or if either candidate drops out of the race, this market will resolve to \"No\".\n\nThe resolution source will be the video of the debate.",
        "end_date": "2024-10-01T12:00:00Z",
        "yes_ask": 0.355,
        "no_ask": 0.645,
        "liquidity": 10858.5783
    },
    {
        "source": "Polymarket",
        "market_id": "0xe517d88554192500fe17d5839fda3bdec5f2afe5e4efee391abc61c6aaad122e",
        "status": "Active",
        "headline": "U.S. evacuates Beirut Embassy by October 31?",
        "description": "This market will resolve to \"Yes\" if the U.S. government announces a full evacuation of the U.S. Embassy in Beirut, Lebanon, or a full evacuation is otherwise confirmed by October 31, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nA full evacuation announced within this markets time frame will qualify for a \"Yes\" resolution regardless of whether an actual evacuation subsequently takes place within the market's timeframe.\n\nAnnouncements of a partial evacuation, where some staff are intended to remain, will not count.\n\nThe resolution source will be official statements from the U.S. government, or a consensus of credible reporting confirming the evacuation of the embassy.",
        "end_date": "2024-10-31T12:00:00Z",
        "yes_ask": 0.325,
        "no_ask": 0.675,
        "liquidity": 2517.4903
    },
    {
        "source": "Polymarket",
        "market_id": "0x69d49cd801c35981676c8c991407623a7add2a0c1a007f28cdccfdf5e74da19a",
        "status": "Active",
        "headline": "Martin Shkreli jail in 2024?",
        "description": "This market will resolve to \"Yes\" if Martin Shkreli serves any time in a federal, state, or local U.S. jail or prison between June 17 and December 31, 2024, by 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nThe primary resolution source for this market will be official information from the U.S. Government, however a consensus of credible reporting may also be used.\n",
        "end_date": "2024-12-31T12:00:00Z",
        "yes_ask": 0.045,
        "no_ask": 0.955,
        "liquidity": 11055.9091
    },
    {
        "source": "Polymarket",
        "market_id": "0x63d2c75b928071eabe91fc71e592b4b079d04349cdf54134a28f0a8370c495b5",
        "status": "Active",
        "headline": "Will China unban Bitcoin in 2024?",
        "description": "This market will resolve to \"Yes\" if the government of the People's Republic of China (PRC) explicitly announces that Chinese citizens will be allowed to legally buy Bitcoin with yuan (renminbi) from inside China between July 14 and December 31, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nFor this market to resolve to \"Yes\" it is only necessary that the PRC announces this change will take place. Whether it actually does will have no bearing on the resolution of this market.\n\nThe primary resolution source for this market will be official information from the PRC, however a consensus of credible reporting will also be used.\n\n",
        "end_date": "2024-12-31T12:00:00Z",
        "yes_ask": 0.045,
        "no_ask": 0.955,
        "liquidity": 53544.2388
    },
    {
        "source": "Polymarket",
        "market_id": "0x7874d6195e3db71556ea07044420dc8889a7c3a41c75135377346d6813a7b0bb",
        "status": "Active",
        "headline": "Will a candidate from another party win California US Senate Election?",
        "description": "United States general elections are scheduled to take place on November 5, 2024. Regular senate elections are presently scheduled for 33 states.\n\nThis market will resolve to “Yes” if a candidate from neither the Democratic nor Republican parties wins the 2024 California US Senate election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification. ",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.0055,
        "no_ask": 0.9945,
        "liquidity": 138724.89382
    },
    {
        "source": "Polymarket",
        "market_id": "0xeb3cef6b7f43fcd35ce139e89c0b00cbc3a70a556c87ef934f8ca984208aaaa8",
        "status": "Active",
        "headline": "Will the Lions win Super Bowl 2025?",
        "description": "This market will resolve to \"Yes\" if the Detroit Lions win Super Bowl LIX. Otherwise, this market will resolve to \"No\".\n\nIf at any point it becomes impossible for this team to win the Super Bowl based on the rules of the NFL (e.g. they are eliminated in the playoff bracket), this market will resolve immediately to \"No\".",
        "end_date": "2025-02-09T12:00:00Z",
        "yes_ask": 0.066,
        "no_ask": 0.934,
        "liquidity": 197740.39506
    },
    {
        "source": "Polymarket",
        "market_id": "0x5fd3d8604616935f40f6e57ba23f1b57ed8550f2a9df09b2c8be044c4c2489b8",
        "status": "Active",
        "headline": "Brentford wins the Premier League?",
        "description": "This market will resolve to “Yes” if Brentford is the 2024-25 Premier League Champion. Otherwise, the market will resolve to “No”.\n\nIf it is a mathematical certainty Brentford will win, this market will immediately resolve to “Yes.” Likewise, if it becomes mathematically impossible for Brentford to win, this market will immediately resolve to “No.” Potential retroactive points deductions past these points will have no bearing on this market’s resolution.",
        "end_date": "2025-05-25T12:00:00Z",
        "yes_ask": 0.0025,
        "no_ask": 0.9975,
        "liquidity": 78093.21367
    },
    {
        "source": "Polymarket",
        "market_id": "0xed19e48134b14b0188c49c7071c08c5dbe1a18804a4ab92baa7f8f4091408322",
        "status": "Active",
        "headline": "Will Florida legalize weed?",
        "description": "Florida Amendment 3 is set to be voted on during the November 5, 2024 US general elections. This amendment seeks to legalize recreational marijuana use in the State of Florida. More information on this initiative can be found here: https://dos.elections.myflorida.com/initiatives/initdetail.asp?account=83475&seqnum=2\n\nThis market will resolve \"Yes\" if Florida Amendment 3 passes as a result of the vote scheduled for November 5, 2024. Otherwise, this market will resolve to \"No\".\n\nThe primary resolution source for this market will be a consensus of credible media sources regarding this vote, however in case of ambiguity this market may remain open until official state results are released.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.8,
        "no_ask": 0.2,
        "liquidity": 6273.2944
    },
    {
        "source": "Polymarket",
        "market_id": "0xa650b0fc83f8b6063ed31d2fcee2c30c60405e7215341a5563f1236f5542a14d",
        "status": "Active",
        "headline": "Will RFK Jr. debate Biden/Trump?",
        "description": "This market will resolve to \"Yes\" if Robert F. Kennedy Jr. engages in a live, publicly broadcast debate with either Joe Biden or Donald Trump by November 4, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nBoth in-person debates and virtual debates will count toward a \"Yes\" resolution for this market.\n\nThe resolution source for this market will be footage of such a debate, however a consensus of credible sources will also be used.\n",
        "end_date": "2024-11-04T12:00:00Z",
        "yes_ask": 0.0175,
        "no_ask": 0.9825,
        "liquidity": 253733.88129
    },
    {
        "source": "Polymarket",
        "market_id": "0x82383a251c5f9fd079dbad01fbed20e6a1e9c59fa90c0336144174aa49350abc",
        "status": "Active",
        "headline": "Will Christian McCaffrey play Week 6?",
        "description": "This market will resolve to \"Yes\" if Christian McCaffrey plays in the San Francisco 49ers' Week 6 game against the Seattle Seahawks scheduled for October 10, 2024. Otherwise, this market will resolve to \"No\".\n\nIf the game is canceled or postponed beyond October 13, 2024, this market will resolve to \"No\".\n\nIf McCaffrey is cut, traded, retires, or is otherwise officially ruled out for the game, this market will resolve to \"No\".\n\n\"Playing\" is defined as Christian McCaffrey participating in at least one snap (including kickoffs) during the game. Merely being on the game-day roster will not qualify for a \"Yes\" resolution.",
        "end_date": "2024-10-10T12:00:00Z",
        "yes_ask": 0.0385,
        "no_ask": 0.9615,
        "liquidity": 13246.3635
    },
    {
        "source": "Polymarket",
        "market_id": "0xab66a7d5745fc4da8a30a67665ee1de894b740644e643a6c6ec39b17212e4df5",
        "status": "Active",
        "headline": "Will Israel invade Lebanon in September?",
        "description": "This market will resolve to \"Yes\" if Israel commences a military offensive intended to establish control over any portion of Lebanon between September 17, 2024 and September 30, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nThe resolution source for this market will be will be official confirmation by Lebanon, Israel, the United Nations, or any permanent member of the UN Security Council, however a consensus of credible reporting will also be used.",
        "end_date": "2024-09-30T12:00:00Z",
        "yes_ask": 0.105,
        "no_ask": 0.895,
        "liquidity": 17985.1506
    },
    {
        "source": "Polymarket",
        "market_id": "0xf44118c55dfd0a17ecf5cb7d9bd40b2be50a478b7391ad417b3649ebba4af841",
        "status": "Active",
        "headline": "Will Texas A&M and Arkansas combine for 53 or more points?",
        "description": "This market refers to the NCAAF matchup between the Texas A&M Aggies and the Arkansas Razorbacks scheduled for September 28, 2024, at 3:30 PM ET.\n\nIf the combined total points scored by the Texas A&M Aggies and the Arkansas Razorbacks in their game on September 28, 2024, is 53 or more, this market will resolve to “Over\". If it is less than 53, this market will resolve to “Under\".\n\nIf this game is postponed after October 5, 2024 (11:59 PM ET), or cancelled, this market will resolve 50-50.\n\nThe primary resolution source for this market will be official information from the NCAA, however, a consensus of credible reporting will also be used.",
        "end_date": "2024-09-28T12:00:00Z",
        "yes_ask": null,
        "no_ask": null,
        "liquidity": null
    },
    {
        "source": "Polymarket",
        "market_id": "0x20d3e6d730dee56569130a6f335f1e14766f72374a1e77cdde6318988ab9b944",
        "status": "Active",
        "headline": "Will Baylor beat BYU?",
        "description": "In the upcoming NCAA Football game, scheduled for September 28, 2024, at 12:00 PM ET:\n\nIf the Baylor Bears win, the market will resolve to “Baylor.”\n\nIf the BYU Cougars win, the market will resolve to “BYU.”\n\nIf the game is not completed by October 5, 2024 (11:59 PM ET) or it ends in a tie, the market will resolve 50-50.\n\nThe primary resolution source for this market will be official information from the NCAA, however, a consensus of credible reporting will also be used.",
        "end_date": "2024-09-28T12:00:00Z",
        "yes_ask": null,
        "no_ask": null,
        "liquidity": 107.24218
    },
    {
        "source": "Polymarket",
        "market_id": "0x39d82ada028f257111b606d76ca2930b639f60e10f05cb23193da57c08e1cf1c",
        "status": "Active",
        "headline": "Israel x Hamas ceasefire before October?",
        "description": "This market will resolve to \"Yes\" if there is an official ceasefire agreement, defined as a publicly announced and mutually agreed halt in military engagement, between Israel and Hamas between August 18, 12:00 PM ET and September 30, 2024, 11:59 PM ET.\n\nAn official ceasefire agreement requires public recognition by both parties. Any form of informal, unratified, or verbal agreement will not be considered an official ceasefire. The ceasefire must last at least 24 hours and have begun before the resolution date. For example, if the ceasefire begins on September 30, this market would resolve to \"Yes\" if the ceasefire continues for 24 hours.\n\nThis market's resolution will be based on official government announcements from both Israel and Hamas, or reports from credible media source\n",
        "end_date": "2024-09-30T12:00:00Z",
        "yes_ask": 0.004,
        "no_ask": 0.996,
        "liquidity": 39074.67325
    },
    {
        "source": "Polymarket",
        "market_id": "0x136e99098f7d4087b4c5775d9f9a512de67e50bda37e88fa86b05a226c390182",
        "status": "Active",
        "headline": "Will a Republican win the popular vote and a Democrat win the Presidency?",
        "description": "This market will resolve to “Yes” if a Republican candidate wins the popular vote and a Democratic candidate wins the Presidency in the 2024 U.S. Presidential Election. Otherwise this market will resolve to \"No\".\n\nThe resolution source for the popular vote will be an overwhelming consensus of credible reporting as to who is the winner of the popular vote.\n\nThe resolution source for the winner of the Presidency will be the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race for the same candidate by the inauguration date (January 20, 2025) this market will resolve based on who is inaugurated.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.027,
        "no_ask": 0.973,
        "liquidity": 146889.08819
    },
    {
        "source": "Polymarket",
        "market_id": "0xd9e25329482e20b622a807e0c913fa15d86084630332e77d558bb29f1369f7f2",
        "status": "Active",
        "headline": "Will Tim Walz say \"Tampon\" during the debate?",
        "description": "Tim Walz and J.D. Vance are currently scheduled to debate on October 1, in an event hosted by CBS.\n\nThis market will resolve to \"Yes\" if Walz says \"Tampon\" at any point during the first vice presidential debate between Tim Walz and J.D. Vance in the 2024 election cycle. Otherwise, this market will resolve to \"No\".\n\nAny usage of the word regardless of context will count toward the resolution of this market.\n\nPluralization/possessive of the word will count toward the resolution of this market, however other forms will NOT count.\n\nCompound words will count as long as \"tampon\" is part of the compound word and references the meaning which refers to the feminine hygiene product.\n\nIf no such debate in the 2024 election cycle happens by November 4, 2024, 11:59 PM ET, or if either candidate drops out of the race, this market will resolve to \"No\".\n\nThe resolution source will be the video of the debate.",
        "end_date": "2024-10-01T12:00:00Z",
        "yes_ask": 0.115,
        "no_ask": 0.885,
        "liquidity": 7708.9697
    },
    {
        "source": "Polymarket",
        "market_id": "0xf501407c058c2f4fd2cfd181e3d9e437c4bdcde0a5a84260322c9192749950ab",
        "status": "Active",
        "headline": "WNBA: Liberty vs. Aces Series Winner",
        "description": "In the 2024 WNBA Playoff Semifinal Series between the New York Liberty and the Las Vegas Aces:\n\nIf the New York Liberty win the series, the market will resolve to “Liberty”.\n\nIf the Las Vegas Aces: win the series, the market will resolve to “Aces”.\n\nThe resolution source will be WNBA.com.",
        "end_date": "2024-10-08T12:00:00Z",
        "yes_ask": null,
        "no_ask": null,
        "liquidity": 13882.4695
    }
]