[
    {
        "source": "Polymarket",
        "market_id": "0xdb4fcf888647104556c7c77ae6712184745ac08e1ea2d1f80e01302209cbfb3e",
        "status": "Active",
        "headline": "Will NA win the most seats in the 2024 Lithuania legislative election?",
        "description": "Lithuanian legislative elections are are scheduled for October 13, 2024, with a potential second round on October 27.\n\nThis market will resolve to \"Yes\" if NA (Dawn of Nemunas, Nemuno aušra) wins the most seats in the Seimas as a result of the next Lithuanian legislative election.\n\nIf voting in the next Lithuanian legislative election does not occur by December 31, 2024, this market will resolve to \"No\".\n\nIn the case of a tie between this party and any other for the most seats gained, this market will resolve in favor of the party whose listed name comes first in alphabetical order.\n\nThis market's resolution will be based solely on the number of seats won by the TS-LKD, not any coalition or alliance of which it may be a part.\n\nThe primary resolution source for this market will be official information from the Lithuanian Government, however, a consensus of credible reporting may also be used.",
        "end_date": "2024-10-13T12:00:00Z",
        "yes_ask": 0.017,
        "no_ask": 0.983,
        "liquidity": 8382.24318
    },
    {
        "source": "Polymarket",
        "market_id": "0xf597a7c656ff054e4f2d028e30ac5b68fcfe35f6360e07e093c5beb403e1945c",
        "status": "Active",
        "headline": "Will a candidate from another party win Tennessee Presidential Election?",
        "description": "This market will resolve to \"Yes\" if a candidate from neither the Democratic nor Republican parties wins the popular vote in Tennessee in the 2024 US presidential election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification.\n",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.004,
        "no_ask": 0.996,
        "liquidity": 109164.55813
    },
    {
        "source": "Polymarket",
        "market_id": "0x64421b34635bdf97a3a10ff214069c087aa2728cbc44451cfad88517e1f942a3",
        "status": "Active",
        "headline": "Will a candidate from another party win Indiana Presidential Election?",
        "description": "This market will resolve to \"Yes\" if a candidate from neither the Democratic nor Republican parties wins the popular vote in Indiana in the 2024 US presidential election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.003,
        "no_ask": 0.997,
        "liquidity": 140990.69677
    },
    {
        "source": "Polymarket",
        "market_id": "0xe193525e9e5bba723dc7032e589b7d6fcb5f3c002e4427428a0bc70e56033e97",
        "status": "Active",
        "headline": "Will a candidate from another party win Kansas Presidential Election?",
        "description": "This market will resolve to \"Yes\" if a candidate from neither the Democratic nor Republican parties wins the popular vote in Kansas in the 2024 US presidential election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.003,
        "no_ask": 0.997,
        "liquidity": 168319.81608
    },
    {
        "source": "Polymarket",
        "market_id": "0x5997cd6096c218411758371421538280a309fb3d465acfda751e3f37944e8ed5",
        "status": "Active",
        "headline": "Trump sentenced to 48 or more months prison time?",
        "description": "This market will resolve to \"Yes\" if Donald Trump is sentenced to spend 48 or more months in the custody of a jail or prison, as part of \"The State of New York vs. Donald Trump\". Otherwise, this market will resolve to \"No\".\n\nThis market will resolve immediately based on the first sentence passed in this case, regardless of appeals. If the first sentencing in this case does not include jail or prison time, this market will resolve to \"No\".\n\nIf no sentence is rendered in this case by November 4, 2024, 11:59 PM ET, this market will resolve to \"No\".\n\nThe primary resolution source for this market will be official information from involved government(s), however a consensus of credible reporting may also be used.",
        "end_date": "2024-07-11T12:00:00Z",
        "yes_ask": 0.008,
        "no_ask": 0.992,
        "liquidity": 181798.83196
    },
    {
        "source": "Polymarket",
        "market_id": "0xebd09819ef04d3d8c255e4012c96bb7d4e37315d0b96e8d9ec82c1ad010799d4",
        "status": "Active",
        "headline": "Will Ethereum hit $15k in 2024?",
        "description": "This market will resolve to \"Yes\" if Ethereum (ETH) reaches a price of 15,000 or greater according to Binance by December 31, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nThe resolution source for this market will be the 30-min candlestick high prices from Binance (https://www.binance.com/en/trade/ETH_USDT). If Binance is unavailable, a consensus of other credible sources will be used.\n\nNote: If it is clear there is a large data discrepancy issue with Binance (e.g. ETH only hit 10k on other exchanges but 15k on Binance), a consensus of other credible sources may be used. ",
        "end_date": "2024-12-31T00:00:00Z",
        "yes_ask": 0.021,
        "no_ask": 0.979,
        "liquidity": 64985.47384
    },
    {
        "source": "Polymarket",
        "market_id": "0xcbc3345df304613a4f8e8713b905c502f664fcb670a10c882709fb804d67783e",
        "status": "Active",
        "headline": "Will a Democrat win Utah Governor Election?",
        "description": "United States general elections are scheduled to take place on November 5, 2024. Gubernatorial elections are presently scheduled for 11 states and 2 territories.\n\nThis market will resolve to “Yes” if the candidate who wins the 2024 Utah gubernatorial election is a Democrat. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.02,
        "no_ask": 0.98,
        "liquidity": 92994.25014
    },
    {
        "source": "Polymarket",
        "market_id": "0xc3c3e6e41c0f268a011a611bc8362e28f85e193159c5ab240c4bf17acb369321",
        "status": "Active",
        "headline": "Will FlyQuest win LoL Worlds 2024?",
        "description": "The League of Legends World Championship 2024 is scheduled to conclude on November 2, 2024. You can find more information about that tournament here: https://lolesports.com/en-US?leagues=lcs,worlds\n\nThis market will resolve to \"Yes\" if FlyQuest wins this tournament. Otherwise, this market will resolve to \"No\".\n\nIf this team is eliminated from the competition based on the official rules of the tournament, this market will resolve to “No”.\n\nIf the winner of The League of Legends World Championship 2024 is not determined by November 30, 2024 11:59 PM ET, this market will resolve to \"No\".\n\nThe primary resolution source for this market is official information provided directly from Riot Games (e.g. lolesports.com) and official footage of the tournament, however other credible reporting may be used.",
        "end_date": "2024-11-02T12:00:00Z",
        "yes_ask": 0.0115,
        "no_ask": 0.9885,
        "liquidity": 31348.08712
    },
    {
        "source": "Polymarket",
        "market_id": "0x0043a0a5f85400263a0cd045332ae8b0ae5433cef663aef6374437320da11a98",
        "status": "Active",
        "headline": "Will a Democrat win Louisiana Presidential Election?",
        "description": "This market will resolve to \"Yes\" if a Democratic candidate wins the popular vote in Louisiana in the 2024 US presidential election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification.",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.0205,
        "no_ask": 0.9795,
        "liquidity": 201392.37654
    },
    {
        "source": "Polymarket",
        "market_id": "0xed9ebea7bb1b444f2c8921e85e7aed5068b3552369a7f6df7def39f7fde4a417",
        "status": "Active",
        "headline": "Will LNG Esports win LoL Worlds 2024?",
        "description": "The League of Legends World Championship 2024 is scheduled to conclude on November 2, 2024. You can find more information about that tournament here: https://lolesports.com/en-US?leagues=lcs,worlds\n\nThis market will resolve to \"Yes\" if LNG Esports wins this tournament. Otherwise, this market will resolve to \"No\".\n\nIf this team is eliminated from the competition based on the official rules of the tournament, this market will resolve to “No”.\n\nIf the winner of The League of Legends World Championship 2024 is not determined by November 30, 2024 11:59 PM ET, this market will resolve to \"No\".\n\nThe primary resolution source for this market is official information provided directly from Riot Games (e.g. lolesports.com) and official footage of the tournament, however other credible reporting may be used.",
        "end_date": "2024-11-02T12:00:00Z",
        "yes_ask": 0.075,
        "no_ask": 0.925,
        "liquidity": 46286.1754
    },
    {
        "source": "Polymarket",
        "market_id": "0xaf531222da8393a4341686e5fbf29dba3b7e76f8df4a681fddc2587658ffe93f",
        "status": "Active",
        "headline": "Will another player be the top goalscorer in the EPL?",
        "description": "This market will resolve to “Yes” if a player other than Erling Haaland, Mohamed Salah, Alexander Isak, Ollie Watkins, Julian Alvarez, Heung-Min Son, Kai Havertz, Cole Palmer, Dominic Solanke, Luis Diaz, Bukayo Saka, Diogo Jota, Nicolas Jackson, or Jamie Vardy is the top goalscorer for the 2024/2025 English Premier League season. Otherwise, this market will resolve to “No”.\n\nIf multiple players tie for the most goals in the 2024/2025 English Premier League season, the market will resolve based on most assists, then most games played, and finally the player’s last name alphabetically if ties persist.\n\nThe primary resolution source for this market will be official information from the English Premier League. However, a consensus of credible reporting may also be used.",
        "end_date": "2025-05-25T12:00:00Z",
        "yes_ask": 0.007,
        "no_ask": 0.993,
        "liquidity": 3934.3782
    },
    {
        "source": "Polymarket",
        "market_id": "0xf75076205d589c02ac13263b0d59041563695a7518d65134f8eb8c61dda22262",
        "status": "Active",
        "headline": "Will Chris Christie win the popular vote in the 2024 Presidential Election?",
        "description": "This market will resolve to “Yes” if Chris Christie is the candidate who receives the most votes in the 2024 U.S. presidential election, otherwise this market will resolve to “No.”\n\nIn case of a tie, this market will resolve in favor of the candidate whose last name comes first in alphabetical order.\n\nThe resolution source will be an overwhelming consensus of credible reporting as to who is the winner of the popular vote.\n\nNote: An update may be made to this market to allow for early expiration if the candidate is definitively no longer in contention for the presidency.\n",
        "end_date": "2024-11-05T00:00:00Z",
        "yes_ask": 0.0005,
        "no_ask": 0.9995,
        "liquidity": 2793296.65045
    },
    {
        "source": "Polymarket",
        "market_id": "0x2a3a29b57597777e5d2941c419716b02a7b8c43b5c19c4ac746ae2d9c720cbe1",
        "status": "Active",
        "headline": "No change in Fed interest rates after 2024 November meeting?",
        "description": "The FED interest rates are defined in this market by the upper bound of the target federal funds range. The decisions on the target federal fund range are made by the Federal Open Market Committee (FOMC) meetings.\n\nThis market will resolve to “Yes” if following the Federal Reserve's November 2024 meeting the upper bound of the target federal funds rate is exactly the same as the level it was prior to the meeting (namely it increased 0 bps). Otherwise, it will resolve to “No.”\n\nThe resolution source for this market is the FOMC’s statement after its meeting scheduled for November 6 - 7, 2024 according to the official calendar: https://www.federalreserve.gov/monetarypolicy/fomccalendars.htm.\n\nThe level and change of the target federal funds rate is also published at the official website of the Federal Reserve at https://www.federalreserve.gov/monetarypolicy/openmarket.htm.\n\nThis market may resolve as soon as the FOMC’s statement for their November meeting with relevant data is issued. If no statement is released by December 18, 2024, 11:59 PM ET, this market will resolve to the \"No change\" bracket.",
        "end_date": "2024-11-07T12:00:00Z",
        "yes_ask": 0.0325,
        "no_ask": 0.9675,
        "liquidity": 215261.13061
    },
    {
        "source": "Polymarket",
        "market_id": "0xc30f00a90f6e41ce6f42b7739c9e3f453351c9b9d596fc4ac7c647c6bcc17e6f",
        "status": "Active",
        "headline": "Will a candidate from another party win Missouri Governor Election?",
        "description": "United States general elections are scheduled to take place on November 5, 2024. Gubernatorial elections are presently scheduled for 11 states and 2 territories.\n\nThis market will resolve to \"Yes\" if a candidate from neither the Democratic nor Republican parties wins the popular vote in Missouri in the 2024 US gubernatorial election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification.",
        "end_date": "2024-11-04T12:00:00Z",
        "yes_ask": 0.003,
        "no_ask": 0.997,
        "liquidity": 137826.925
    },
    {
        "source": "Polymarket",
        "market_id": "0xe8e3c6ba82d48f02e2575b3596b5d431331425fdc01f59f5746c6e4ab9cf74c5",
        "status": "Active",
        "headline": "Will Washington move right in the 2024 U.S. Presidential Election? ",
        "description": "This market will resolve to \"Yes\" if the margin of the Republican candidate's percentage of the vote minus the Democratic candidate's percentage of the vote in the 2024 U.S. Presidential election in Washington is greater than the corresponding margin in the 2020 U.S. Presidential election. If the 2024 margin is equal to or less than the 2020 margin, this market will resolve to \"No.\"\n\nThe resolution source for this market will be the official vote count once the state has certified its votes.\n\nIf there is a recount in this state before certification, the market will remain open until the recount is completed and the vote is certified. If a recount occurs after certification, the recount will not be considered.\n\n",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.51,
        "no_ask": 0.49,
        "liquidity": 3312.865
    },
    {
        "source": "Polymarket",
        "market_id": "0x5c9490cd2121384ebb7a08b0aed1fa9a5239d98096d91b4bd6827c47c94951b2",
        "status": "Active",
        "headline": "Israel military action against Iran by end of 2024?",
        "description": "This market will resolve to \"Yes\" if Israel initiates a military action on Iranian soil, airspace, or maritime territory or against any Iranian embassies or consulates between May 28 and December 31, 2024, 11:59 PM ET. Otherwise, this market will resolve to \"No\".\n\nFor the purposes of this market, a \"military action\" will be considered to be any use of force executed by Israel on Iranian soil, airspace, or maritime territory (e.g. if a weapons depot on Iranian soil is hit by an Israeli missile, this market will resolve to \"Yes\") that is officially acknowledged by the Israeli government or a consensus of credible reporting. This includes, but is not limited to, airstrikes, naval attacks, or ground invasions. Cyber attacks, sanctions, or diplomatic actions will not count towards the resolution of this market.\n\nIn the case that the \"Yes\" resolution criteria are met prior to this market's resolution date, this market will resolve immediately.",
        "end_date": "2024-12-31T12:00:00Z",
        "yes_ask": 0.455,
        "no_ask": 0.545,
        "liquidity": 7631.4023
    },
    {
        "source": "Polymarket",
        "market_id": "0xa0de93ceb5e777e92f1d0f2ce78fdf0ef14989f09b36d53736a01591a616c0ce",
        "status": "Active",
        "headline": "Will a Democrat win Nebraska's 1st congressional district?",
        "description": "This market will resolve to \"Yes\" if a Democratic candidate wins the popular vote in Nebraska's 1st congressional district (NE-1) in the 2024 US presidential election. Otherwise, this market will resolve to \"No\".\n\nA candidate shall be considered to represent a party in the event that he or she is the nominee, or has a ballot-listed or otherwise identifiable party preference, of the party in question.\n\nThe resolution source for this market is the Associated Press, Fox News, and NBC. This market will resolve once all three sources call the race for the same candidate. If all three sources haven’t called the race in this state for the same candidate, this market will resolve based on the official certification. ",
        "end_date": "2024-11-05T12:00:00Z",
        "yes_ask": 0.012,
        "no_ask": 0.988,
        "liquidity": 114780.87857
    },
    {
        "source": "Polymarket",
        "market_id": "0x0ee96c2cfb5e5a089f39db58f7e8c482568151e9ca36c6e3d2efc44d9aa312cc",
        "status": "Active",
        "headline": "Will Circle IPO in 2024?",
        "description": "This market will resolve to \"Yes\" if Circle completes an Initial Public Offering (IPO) by December 31, 2024, 11:59 PM ET, as confirmed by official company announcements or credible news sources. The IPO refers to the first sale of stock by Circle to the public on any recognized stock exchange.\n\nIf Circle merges with another entity, is acquired, or ceases to exist before the market resolves, the market will also resolve to \"No\".\n\nThis market will resolve early if Circle completes an IPO by December 31, 2024, 11:59 PM ET.\n\nThe resolution source for this market is a consensus of credible reporting.",
        "end_date": "2024-12-31T12:00:00Z",
        "yes_ask": 0.185,
        "no_ask": 0.815,
        "liquidity": 2384.0628
    },
    {
        "source": "Polymarket",
        "market_id": "0xe9fe2c3cb9b2afbb5e58bbcebe85c701821f1fb298de6b90b2193d1ca46cfef9",
        "status": "Active",
        "headline": "Will Kamala Harris drop out in September?",
        "description": "This market will resolve to \"Yes\" if Kamala Harris withdraws from or officially announces her withdrawal from the 2024 US presidential race, or announces the suspension of her 2024 US presidential campaign, by 11:59 PM ET on September 30, 2024.\n\nIn the event of any extenuating circumstances that prevent Kamala Harris from continuing the race, this market will also resolve to \"Yes\".\n\nIf Kamala Harris does not announce her withdrawal or campaign's suspension, or is not forced to withdraw from the 2024 presidential race by the specified time, this market will resolve to \"No\".\n\nThe primary resolution source for this market will be official information from Kamala Harris or her official/legal representatives, however a consensus of credible reporting will also be used.",
        "end_date": "2024-09-30T12:00:00Z",
        "yes_ask": 0.0015,
        "no_ask": 0.9985,
        "liquidity": 88952.78468
    },
    {
        "source": "Polymarket",
        "market_id": "0x39ee169bbda6909960fc99494e518bc02d7761025b26cc35766eb4ae2b1ff90d",
        "status": "Active",
        "headline": "September temperature increase by between 1.17-1.22°C?",
        "description": "This market will resolve to \"Yes\" if the data for the Global Land-Ocean Temperature Index for September 2024 shows an increase of between 1.17°C (inclusive) and 1.22°C (inclusive) when it is released. Otherwise, this market will resolve to \"No\".\n\nAn anomaly of between 1.17°C (inclusive) and 1.22°C (inclusive) for September 2024 is necessary and sufficient to resolve this market to \"Yes\" immediately once the data becomes available regardless of whether the figure for September 2024 is later revised.\n\nThe primary resolution source for this market will be the figure found in the table titled \"GLOBAL Land-Ocean Temperature Index in 0.01 degrees Celsius\" under the column \"Sep\" in the row \"2024\" (https://data.giss.nasa.gov/gistemp/tabledata_v4/GLB.Ts+dSST.txt). If NASA's \"Global Temperature Index\" is rendered permanently unavailable, other information from NASA may be used. If no information for September 2024 is provided by NASA by January 1, 2025, 11:59 PM ET, this market will resolve \"No\".",
        "end_date": "2025-01-01T12:00:00Z",
        "yes_ask": 0.0555,
        "no_ask": 0.9445,
        "liquidity": 3935.51059
    }
]